# Code-for-job
def multiply(*arguments): # Функция возвращает результат умножения переданных множителей. Также * здесь для произвольного количества чисел для умножения.
    result = 1 # 1 число нейтрально, поэтому я его и взял
    for numbers in arguments: # Здесь переменная result умножается на numbers то есть множители на 1. Тем самым мы получаем ответ
        result = result * numbers 
    return result # Возвращение результата, то есть ответа
print(multiply()) # Выписывание самого ответа.

Рассуждая как это сделать я взял во внимание то, что аргументов, то есть множителей может быть любое кол-во, поэтому я в параметрах функции multiply установил звездочку перед аргументом arguments.
И как, собственно работает программа.
1) Введите через запятую в print(multiply( ВОТ ЗДЕСЬ )) множители через запятую и запустите программу. Готово
